from fastapi import FastAPI
app=FastAPI()

@app.get("/reshte/{reshte}")
def check(reshte:str):
    reshte_ha = [
    "مهندسی عمران","مهندسی برق","مهندسی مکانیک","مهندسی کامپیوتر","مهندسی نرم‌افزار",
    "مهندسی صنایع","مهندسی مواد","مهندسی شیمی","مهندسی پزشکی","مهندسی نفت","مهندسی محیط زیست","مهندسی هوافضا",
    "مهندسی هسته‌ای","مهندسی رباتیک","مهندسی سازه","مهندسی فضایی","مهندسی مخابرات","مهندسی اپتیک و لیزر",
    "مهندسی انرژی","مهندسی سیالات","مهندسی کشاورزی","مهندسی زلزله","مهندسی نور","مهندسی حفاظت","مهندسی ژئوتکنیک",
    "مهندسی اتوماسیون و کنترل","مهندسی هوش مصنوعی","مهندسی کامپیوتر و فناوری اطلاعات","مهندسی صوتی و تصویری",
    "مهندسی بیومدیکال","مهندسی راه و ترابری","مهندسی کاربردی","مهندسی پیشرفته","مهندسی الکترونیک","مهندسی ماینینگ","مهندسی ارتباطات",
    "مهندسی حسابداری",
    "مهندسی سیستم‌های اطلاعاتی","مهندسی برق قدرت","مهندسی کنترل و ابزار دقیق","مهندسی زمین‌شناسی","مهندسی معدن","مهندسی جوشکاری",
    "مهندسی مخابرات بی‌سیم","مهندسی متالورژی","مهندسی روباتیک و اتوماسیون","مهندسی ساختمان","مهندسی آب و فاضلاب",
    "مهندسی فرایند","مهندسی کاربردی فناوری‌های نوین"]
    if reshte in reshte_ha:
        return("رشته ی وارد شده جزو رشته های فنی مهندسی است")
    else:
        return("رشته ی وارد شده جزو رشته های فنی مهندسی نیست")