from fastapi import FastAPI
app=FastAPI()

@app.get("/city/{city}")
def check(city:str):
    shahr = [
    "تهران", "مشهد", "اصفهان", "کرج", "شیراز", "تبریز",
    "اهواز", "قم", "کرمانشاه", "اراک", "زاهدان", "رشت",
    "کرمان", "یزد", "همدان", "ارومیه", "زنجان", "سنندج",
    "ساری", "بندرعباس", "یاسوج", "اردبیل", "بیرجند", "سمنان",
    "قزوین", "گرگان", "هرمزگان", "بوشهر", "قائم‌شهر", "ملایر",
    "بجنورد", "ساوه", "سبزوار", "سیاهکل", "گلپایگان", "کاشان",
    "قائن", "بندر گز", "دماوند", "بابل", "بندر ماهشهر", "نیشابور",
    "مهاباد", "شاهرود", "مرند", "فریدون‌شهر", "خرم‌آباد", "آمل",
    "شهرکرد", "گناباد", "شهر ری", "فومن", "رودسر", "رامسر",
    "شوش", "فیروزکوه", "گرمسار", "تالش", "بندر انزلی", "تنکابن",
    "کلاردشت", "کیش", "رشتخوار", "ملارد", "تبریز", "بندر امام خمینی",
    "سیرجان", "لامرد", "پردیس", "فیروزآباد", "محمودآباد", "ایلام",
    "قاین", "زاهدان", "رودهن", "کلیشادوسودرجان", "نی‌ریز", "باقرشهر",
    "تویسرکان", "فردوس", "رودبار", "خمین", "زنجان"
    ]
    if city in shahr:
        return(" ورودی جزو شهر های ایران است")
    else:
        return("ورودی جزو شهر های ایران نیست/ورودی شهر نیست/شهر ورودی در پایگاه داده موجود نیست")